Revit.Elements.GroupType.#ctor(System.String)
Init GroupType with typeId of a ForgeTypeId
typeId:

Revit.Elements.GroupType.#ctor(Autodesk.Revit.DB.ForgeTypeId)
Init GroupType with an existing ForgeTypeId
forgeTypeId:

Revit.Elements.GroupType.ByTypeId(System.String)
Get a GroupType by forge schema identifier.
typeId: a schema identifier
Returns:

Revit.Elements.GroupType.FromExisting(Autodesk.Revit.DB.ForgeTypeId)
Wrap an existing ForgeTypeId to GroupType
forgeTypeId:
Returns: